Conf.Simple/src/InformationRegisters/SUI_docs_tbl_goods_delta/SUI_docs_tbl_goods_delta.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_goods_delta</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>d_qtty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_cell</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_price</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>use_series</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТаблицы</name>
    <type>
      <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ОчередьЗаданий/SUI_ОчередьЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ОчередьЗаданий</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.SUI_СтатусыОбработкиОчередиЗаданий</types>
    </type>
  </resources>
  <resources>
    <name>Обработчики</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗадания</name>
    <comment>Идентификатор фонового задания</comment>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ОбработчикЗавершения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВнеОчереди</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Создано</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Обновлено</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сеанс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписаниеРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданоМеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновленоМеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_goods/SUI_docs_tbl_goods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_goods</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>id_cell</name>
    <comment>Ячейка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_good</name>
    <comment>Номенклатура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_price</name>
    <comment>Вид цены</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <comment>Характеристика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <comment>Серия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <comment>Упаковка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>price</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>qtty</name>
    <comment>Количество (факт)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>qtty_plan</name>
    <comment>Количество (план)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_series</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>last_updated</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТаблицы</name>
    <type>
      <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_СтатусыОбработкиОчередиЗаданий/SUI_СтатусыОбработкиОчередиЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СтатусыОбработкиОчередиЗаданий</name>
  <enumValues>
    <name>Открыто</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_goods_delta/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Загрузить пересчет.
// 
// Параметры:
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство данных пересчета
//  ИдентификаторДокумента - Строка - Идентификатор документа пересчета
//  Данные - ТаблицаЗначений - Данные пересчета см. SUI_ДокументыОбмена.ТаблицаПересчетТоваровДокументаОбмена
//  Перезаписать - Булево - Записать данные пересчета очистив старые
// 
// Возвращаемое значение:
//  Структура - Загрузить пересчет:
// * ДанныеЗагружены - Булево - Признак загруженных данных
// * Ошибки - Массив из Строка - Массив ошибок возникших при загрузке
Функция ЗагрузитьПересчет(МобильноеУстройство, ИдентификаторДокумента, Данные, Перезаписать = Ложь) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ДанныеЗагружены", Ложь);
	Результат.Вставить("Ошибки", Новый Массив());
	
	Если Данные.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДокументыОбмена = ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента);
	
	Если ДокументыОбмена.Документы.Количество() = 0 Тогда
		Результат.Ошибки = ДокументыОбмена.Ошибки;
	Иначе
		
		НачатьТранзакцию();
		
		Попытка
			
			Если Перезаписать Тогда
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_goods_delta");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных = ДокументыОбмена.Документы;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid");
				ЭлементБлокировки.УстановитьЗначение("МобильноеУстройство", МобильноеУстройство);
				Блокировка.Заблокировать();
				
			КонецЕсли;
			
			Для Каждого СтрокаДокумент Из ДокументыОбмена.Документы Цикл
				
				ДатаЗаписи = ТекущаяДатаСеанса();
				
				Если Перезаписать Тогда
					
					НаборЗаписей = СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.sid_doc.Установить(СтрокаДокумент.sid);
					НаборЗаписей.Отбор.МобильноеУстройство.Установить(МобильноеУстройство);
					
					Для Каждого СтрокаДанных Из Данные Цикл
						
						Запись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(Запись, СтрокаДанных);
						
						Запись.Период = ДатаЗаписи;
						Запись.sid = Новый УникальныйИдентификатор();
						Запись.sid_doc = СтрокаДокумент.sid;
						Запись.МобильноеУстройство = МобильноеУстройство;
						
					КонецЦикла;
					
					НаборЗаписей.ОбменДанными.Загрузка = Истина;
					НаборЗаписей.Записать(Истина);
					
				Иначе
					
					Для Каждого СтрокаДанных Из Данные Цикл
						
						Запись = СоздатьМенеджерЗаписи();
						ЗаполнитьЗначенияСвойств(Запись, СтрокаДанных);
						
						Запись.Период = ДатаЗаписи;
						Запись.sid = Новый УникальныйИдентификатор();
						Запись.sid_doc = СтрокаДокумент.sid;
						Запись.МобильноеУстройство = МобильноеУстройство;
						
						Запись.Записать(Истина);
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Результат.ДанныеЗагружены = Истина;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Ошибка = ИнформацияОбОшибке();
			ТекстОшибки = НСтр("ru = 'Ошибка записи данных пересчета!'");
			ВызватьИсключение(ТекстОшибки, , , , Ошибка);
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеПересчетаСтрок(МобильноеУстройство, ИдентификаторДокумента) Экспорт
	
	ДанныеПересчета = Новый Массив();
	
	ДокументыОбмена = ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента);
	
	Если ДокументыОбмена.Документы.Количество() = 0 Тогда
		ВызватьИсключение СтрСоединить(ДокументыОбмена.Ошибки);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Запрос.УстановитьПараметр("ИдентификаторыДокументовОбмена", ДокументыОбмена.Документы.ВыгрузитьКолонку("sid"));
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ИдентификаторДокумента КАК id_doc,
		|	ПересчетТоваров.id_good,
		|	ПересчетТоваров.id_properties,
		|	ПересчетТоваров.id_series,
		|	ПересчетТоваров.id_cell,
		|	ПересчетТоваров.id_unit,
		|	ПересчетТоваров.id_price,
		|	ПересчетТоваров.price,
		|	СУММА(ПересчетТоваров.d_qtty) КАК qtty,
		|	СУММА(ВЫБОР
		|		КОГДА НЕ МобильныеУстройства.Ссылка ЕСТЬ NULL
		|			ТОГДА ПересчетТоваров.d_qtty
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК d_qtty,
		|	ПересчетТоваров.use_series,
		|	ВЫБОР
		|		КОГДА ПересчетТоваров.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор)
		|			ТОГДА ""out""
		|		КОГДА ПересчетТоваров.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение)
		|			ТОГДА ""in""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК table_type
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_goods_delta КАК ПересчетТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.SUI_МобильныеУстройства КАК МобильныеУстройства
		|		ПО ПересчетТоваров.МобильноеУстройство = МобильныеУстройства.Ссылка
		|		И МобильныеУстройства.Ссылка = &МобильноеУстройство
		|ГДЕ
		|	ПересчетТоваров.sid_doc В (&ИдентификаторыДокументовОбмена)
		|СГРУППИРОВАТЬ ПО
		|	ПересчетТоваров.id_good,
		|	ПересчетТоваров.id_properties,
		|	ПересчетТоваров.id_series,
		|	ПересчетТоваров.id_cell,
		|	ПересчетТоваров.id_unit,
		|	ПересчетТоваров.id_price,
		|	ПересчетТоваров.price,
		|	ПересчетТоваров.use_series,
		|	ВЫБОР
		|		КОГДА ПересчетТоваров.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор)
		|			ТОГДА ""out""
		|		КОГДА ПересчетТоваров.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение)
		|			ТОГДА ""in""
		|		ИНАЧЕ """"
		|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДанныеСтроки = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
			ДанныеПересчета.Добавить(ДанныеСтроки);
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат ДанныеПересчета;
	
КонецФункции

Процедура СоздатьЗаданиеЗавершенияПересчета(МобильноеУстройство, ИдентификаторДокумента) Экспорт
	
	ДокументыОбмена = ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента);
	
	Если ДокументыОбмена.Документы.Количество() = 0 Тогда
		ВызватьИсключение СтрСоединить(ДокументыОбмена.Ошибки);
	КонецЕсли;
	
	НаименованиеОчередиЗаданий = НСтр("ru = 'Завершение группового пересчета'");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьЗаданий.Хеш
		|ИЗ
		|	РегистрСведений.SUI_ОчередьЗаданий КАК ОчередьЗаданий
		|ГДЕ
		|	ОчередьЗаданий.Статус В (&АктивныеСтатусыОчередиЗаданий)
		|	И ОчередьЗаданий.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И ОчередьЗаданий.Наименование ПОДОБНО ""%"" + &НаименованиеОчередиЗаданий + ""%""";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Запрос.УстановитьПараметр("НаименованиеОчередиЗаданий", НаименованиеОчередиЗаданий);
	
	АктивныеСтатусыОчередиЗаданий = Новый Массив();
	АктивныеСтатусыОчередиЗаданий.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто);
	АктивныеСтатусыОчередиЗаданий.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется);
	Запрос.УстановитьПараметр("АктивныеСтатусыОчередиЗаданий", АктивныеСтатусыОчередиЗаданий);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеДокументаОчереди = ИдентификаторДокумента;
	
	УстановитьПривилегированныйРежим(Истина);
	СсылкаДокумента = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ИдентификаторДокумента);
	Если ЗначениеЗаполнено(СсылкаДокумента) Тогда
		ПредставлениеДокументаОчереди = Строка(СсылкаДокумента);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	НаименованиеЗадания = СтрШаблон(НаименованиеОчередиЗаданий + " (%1)", ПредставлениеДокументаОчереди);
	
	ПараметрыСозданияЗадания = SUI_ОчередьЗаданийКлиентСервер.ПараметрыСозданияЗадания();
	ПараметрыСозданияЗадания.ИдентификаторДокумента = ИдентификаторДокумента;
	ПараметрыСозданияЗадания.Наименование = НаименованиеЗадания;
	
	ПараметрыПроцедуры = Новый Массив();
	ПараметрыПроцедуры.Добавить(ИдентификаторДокумента);
	ПараметрыПроцедуры.Добавить(МобильноеУстройство);
	
	SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания,
		"РегистрыСведений.SUI_docs_tbl_goods_delta.ВыполнитьЗавершениеПересчетаПоДокументу", ПараметрыПроцедуры);
	
	РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание(ПараметрыСозданияЗадания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьИтогиПересчетаВТоварыДокументаОбмена(ИдентификаторДокумента) Экспорт
	
	ДанныеЗагружены = Ложь;
	
	ИтогиПоДокументамОбмена = ПолучитьИтогиПересчетаПоДокументамОбмена(ИдентификаторДокумента);
	
	Для Каждого КлючЗначение Из ИтогиПоДокументамОбмена Цикл
		
		Загруженно = РегистрыСведений.SUI_docs_tbl_goods.ЗагрузитьИзМобильногоУстройства(
			КлючЗначение.Ключ, КлючЗначение.Значение);
		
		Если Загруженно Тогда
			ДанныеЗагружены = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеЗагружены;
	
КонецФункции

Процедура ВыполнитьЗавершениеПересчетаПоДокументу(ИдентификаторДокумента, МобильноеУстройство = Неопределено) Экспорт
	
	ИтогиПоДокументамОбмена = ПолучитьИтогиПересчетаПоДокументамОбмена(ИдентификаторДокумента);
	
	Для Каждого КлючЗначение Из ИтогиПоДокументамОбмена Цикл
		
		ДанныеДляЗагрузки = РегистрыСведений.SUI_docs.ДанныеДляЗагрузкиИзМобильногоУстройства(
			ИдентификаторДокумента, МобильноеУстройство);
		
		ДанныеДляЗагрузки.ИдентификаторДокументаОбмена = КлючЗначение.Ключ;
		ДанныеДляЗагрузки.Таблицы.Товары = КлючЗначение.Значение;
		
		РегистрыСведений.SUI_docs.ЗагрузитьИзМобильногоУстройства(ДанныеДляЗагрузки);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента)
	
	ОтборДокументовОбмена = Новый Соответствие();
	ОтборДокументовОбмена.Вставить("id_doc", ИдентификаторДокумента);
	
	ПоляДокументовОбмена = Новый Соответствие();
	ПоляДокументовОбмена.Вставить("Состояние", "Состояние");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.Используется", "НастройкаДокументаИспользуется");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.ПометкаУдаления", "НастройкаДокументаПометкаУдаления");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.ГрупповоеСканирование", "ГрупповоеСканирование");
	
	РезультатДокументыОбмена = РегистрыСведений.SUI_docs.ПолучитьДанныеДокументовОбмена(
		ОтборДокументовОбмена, ПоляДокументовОбмена);
	
	Результат = Новый Структура();
	Результат.Вставить("Ошибки", Новый Массив());
	Результат.Вставить("Документы", РезультатДокументыОбмена.Выгрузить());
	
	ОтобранныеСтроки = Новый Массив();
	
	Если Результат.Документы.Количество() = 0 Тогда
		
		ТекстОшибки = НСтр("ru = 'Документ обмена ""%1"" не был выгружен.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИдентификаторДокумента);
		Результат.Ошибки.Добавить(ТекстОшибки);
		
	Иначе
		
		РабочиеСостоянияДокументовОбмена = РегистрыСведений.SUI_docs.РабочиеСостоянияДокументовОбмена();
		
		Для Каждого СтрокаДокумент Из Результат.Документы Цикл
			
			Если Не СтрокаДокумент.НастройкаДокументаИспользуется Или СтрокаДокумент.НастройкаДокументаПометкаУдаления Тогда
				
				ТекстОшибки = НСтр("ru = 'Настройка документа обмена ""%1"" (%2) не используется.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, СтрокаДокумент.id_doc, СтрокаДокумент.sid);
				Результат.Ошибки.Добавить(ТекстОшибки);
				
			ИначеЕсли Не СтрокаДокумент.ГрупповоеСканирование Тогда
				
				ТекстОшибки = НСтр("ru = 'Настройка документа обмена ""%1"" (%2) не поддерживает групповую работу.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, СтрокаДокумент.id_doc, СтрокаДокумент.sid);
				Результат.Ошибки.Добавить(ТекстОшибки);
				
			ИначеЕсли РабочиеСостоянияДокументовОбмена.Найти(СтрокаДокумент.Состояние) = Неопределено Тогда
				
				ТекстОшибки = НСтр("ru = 'Документ обмена ""%1"" (%2) находится в состоянии ""%3"".'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, СтрокаДокумент.id_doc, СтрокаДокумент.sid, СтрокаДокумент.Состояние);
				Результат.Ошибки.Добавить(ТекстОшибки);
				
			Иначе
				ОтобранныеСтроки.Добавить(СтрокаДокумент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат.Документы = Результат.Документы.Скопировать(ОтобранныеСтроки);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИтогиПересчетаПоДокументамОбмена(ИдентификаторДокумента)
	
	ИтогиПоДокументамОбмена = Новый Соответствие();
	
	ДокументыОбмена = ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента);
	
	Если ДокументыОбмена.Документы.Количество() = 0 Тогда
		ВызватьИсключение СтрСоединить(ДокументыОбмена.Ошибки);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторыДокументовОбмена", ДокументыОбмена.Документы.ВыгрузитьКолонку("sid"));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПересчетТоваровДокументаОбмена.sid_doc КАК ИдентификаторДокументаОбмена,
		|	ПересчетТоваровДокументаОбмена.id_good,
		|	ПересчетТоваровДокументаОбмена.id_properties,
		|	ПересчетТоваровДокументаОбмена.id_series,
		|	ПересчетТоваровДокументаОбмена.id_cell,
		|	ПересчетТоваровДокументаОбмена.id_unit,
		|	ПересчетТоваровДокументаОбмена.id_price,
		|	ПересчетТоваровДокументаОбмена.price,
		|	СУММА(ПересчетТоваровДокументаОбмена.d_qtty) КАК qtty,
		|	ПересчетТоваровДокументаОбмена.use_series,
		|	ЛОЖЬ КАК use_mark,
		|	ПересчетТоваровДокументаОбмена.ТипТаблицы
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_goods_delta КАК ПересчетТоваровДокументаОбмена
		|ГДЕ
		|	ПересчетТоваровДокументаОбмена.sid_doc В (&ИдентификаторыДокументовОбмена)
		|СГРУППИРОВАТЬ ПО
		|	ПересчетТоваровДокументаОбмена.sid_doc,
		|	ПересчетТоваровДокументаОбмена.id_good,
		|	ПересчетТоваровДокументаОбмена.id_properties,
		|	ПересчетТоваровДокументаОбмена.id_series,
		|	ПересчетТоваровДокументаОбмена.id_cell,
		|	ПересчетТоваровДокументаОбмена.id_unit,
		|	ПересчетТоваровДокументаОбмена.id_price,
		|	ПересчетТоваровДокументаОбмена.price,
		|	ПересчетТоваровДокументаОбмена.ТипТаблицы,
		|	ПересчетТоваровДокументаОбмена.use_series";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Для Каждого СтрокаДокументОбмена Из ДокументыОбмена.Документы Цикл
			
			ТаблицаТовары = РегистрыСведений.SUI_docs_tbl_goods.ПолучитьТаблицуЭталон();
			
			Выборка.Сбросить();
			ПараметрыОтбораПоДокументуОбмена = Новый Структура();
			ПараметрыОтбораПоДокументуОбмена.Вставить("ИдентификаторДокументаОбмена", СтрокаДокументОбмена.sid);
			Пока Выборка.НайтиСледующий(ПараметрыОтбораПоДокументуОбмена) Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаТовары.Добавить(), Выборка);
			КонецЦикла;
			
			Если ТаблицаТовары.Количество() > 0 Тогда
				ИтогиПоДокументамОбмена.Вставить(СтрокаДокументОбмена.sid, ТаблицаТовары);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ИтогиПоДокументамОбмена;
	
КонецФункции

#КонецОбласти

#КонецЕсли
